erlang-emacs-2025.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-08-26 Tue 17:26 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Setting up Emacs for Erlang in 2025</title>
<meta name="generator" content="Org Mode" />
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0, user-scalable=yes">
<link rel="stylesheet" href="index.css">
<meta name="author" content="Wade Mealing" />
<meta name="description" content="Emacs and erlang in 2025" />
<meta http-equiv="Content-Security-Policy"  content="script-src 'self' ajax.googleapis.com;"" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Setting up Emacs for Erlang in 2025</h1>
<p>
Getting Erlang working properly in Emacs in 2025 can be a bit of a challenge. Some things still haven’t changed since
2005 (hello, `distel`), while others are new enough that the documentation hasn’t caught up yet (tree-sitter Erlang,
WhatsApp’s Erlang Language Platform). Here is what i have working.
</p>
<div id="outline-container-org38b6c5b" class="outline-2">
<h2 id="org38b6c5b">Installing Erlang</h2>
<div class="outline-text-2" id="text-org38b6c5b">
<p>
If you install Erlang with Homebrew, beware: you don’t always get the optional extras — like the Emacs Lisp files.
You need the full OTP installation (with all the developer tooling), you’re better off using <a href="https://github.com/kerl/kerl">https://github.com/kerl/kerl</a>.
</p>

<p>
As a fallback: clone the repository and point Emacs directly at it in the later steps.
</p>

<div class="org-src-container">
<pre class="src src-bash">git clone https://github.com/erlang/otp.git
</pre>
</div>

<p>
This gets the most recent version of OTP source, it works with most versions of emacs past 25, for reference I am running emacs 30.
</p>
</div>
</div>
<div id="outline-container-org490fca1" class="outline-2">
<h2 id="org490fca1">Setting up Emacs</h2>
<div class="outline-text-2" id="text-org490fca1">
<p>
You need both the classic <code>erlang</code> mode and the newer tree-sitter based <code>erlang-ts</code> mode. Both need to be installed.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">M-x package-install RET erlang RET
M-x package-install RET company RET
M-x package-install RET flycheck-popup-tip RET
</pre>
</div>
</div>
</div>
<div id="outline-container-org7a503e3" class="outline-2">
<h2 id="org7a503e3">Configure <code>erlang-mode</code></h2>
<div class="outline-text-2" id="text-org7a503e3">
<p>
This is based on the official <a href="https://www.erlang.org/doc/apps/tools/erlang_mode_chapter.html">erlang</a> docs, except with slightly more modern syntax.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">setq</span> erl-root-dir <span style="color: #79a8ff;">"/path/to/erlang/otp/"</span><span style="color: #ffffff;">)</span>
<span style="color: #ffffff;">(</span>add-to-list <span style="color: #b6a0ff;">'</span><span style="color: #00bcff;">load-path</span> <span style="color: #ff66ff;">(</span>concat erl-root-dir <span style="color: #79a8ff;">"lib/tools-&lt;version&gt;/emacs"</span><span style="color: #ff66ff;">)</span><span style="color: #ffffff;">)</span>
<span style="color: #ffffff;">(</span>add-to-list <span style="color: #b6a0ff;">'</span><span style="color: #00bcff;">exec-path</span> <span style="color: #ff66ff;">(</span>concat erl-root-dir <span style="color: #79a8ff;">"bin"</span><span style="color: #ff66ff;">)</span><span style="color: #ffffff;">)</span>
<span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">setq</span> erlang-man-root-dir <span style="color: #ff66ff;">(</span>concat erl-root-dir <span style="color: #79a8ff;">"man"</span><span style="color: #ff66ff;">)</span><span style="color: #ffffff;">)</span>

<span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">require</span> <span style="color: #b6a0ff;">'</span><span style="color: #00bcff;">erlang-start</span><span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org868dc04" class="outline-2">
<h2 id="org868dc04">Setup Flycheck</h2>
<div class="outline-text-2" id="text-org868dc04">
<p>
Hook Erlang into <code>flycheck</code>:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">flycheck-define-checker</span> erlang
      <span style="color: #9ac8e0;">"An Erlang syntax checker using the Erlang compiler."</span>
      <span style="color: #f78fe7;">:command</span> <span style="color: #ff66ff;">(</span><span style="color: #79a8ff;">"erlc"</span> <span style="color: #79a8ff;">"-o"</span> temporary-directory <span style="color: #79a8ff;">"-Wall"</span>
                <span style="color: #79a8ff;">"-I"</span> <span style="color: #79a8ff;">"../include"</span> <span style="color: #79a8ff;">"-I"</span> <span style="color: #79a8ff;">"../../include"</span>
                <span style="color: #79a8ff;">"-I"</span> <span style="color: #79a8ff;">"../../../include"</span> source<span style="color: #ff66ff;">)</span>
      <span style="color: #f78fe7;">:error-patterns</span>
      <span style="color: #ff66ff;">(</span><span style="color: #00eff0;">(</span>warning line-start <span style="color: #ff6b55;">(</span>file-name<span style="color: #ff6b55;">)</span> <span style="color: #79a8ff;">":"</span> line <span style="color: #79a8ff;">": Warning:"</span> <span style="color: #ff6b55;">(</span>message<span style="color: #ff6b55;">)</span> line-end<span style="color: #00eff0;">)</span>
       <span style="color: #00eff0;">(</span><span style="color: #fec43f;">error</span> line-start <span style="color: #ff6b55;">(</span>file-name<span style="color: #ff6b55;">)</span> <span style="color: #79a8ff;">":"</span> line <span style="color: #79a8ff;">": "</span> <span style="color: #ff6b55;">(</span>message<span style="color: #ff6b55;">)</span> line-end<span style="color: #00eff0;">)</span><span style="color: #ff66ff;">)</span>
      <span style="color: #f78fe7;">:modes</span> erlang-mode<span style="color: #ffffff;">)</span>

  <span style="color: #ffffff;">(</span>add-to-list <span style="color: #b6a0ff;">'</span><span style="color: #00bcff;">flycheck-checkers</span> <span style="color: #b6a0ff;">'</span><span style="color: #00bcff;">erlang</span><span style="color: #ffffff;">)</span>

  <span style="color: #989898;">;; </span><span style="color: #989898;">ensure it starts on loading erlang-mode
</span>  <span style="color: #ffffff;">(</span>add-hook <span style="color: #b6a0ff;">'</span><span style="color: #00bcff;">erlang-mode-hook</span>
            <span style="color: #ff66ff;">(</span><span style="color: #b6a0ff;">lambda</span> <span style="color: #00eff0;">()</span>
              <span style="color: #00eff0;">(</span>flycheck-select-checker <span style="color: #b6a0ff;">'</span><span style="color: #00bcff;">erlang</span><span style="color: #00eff0;">)</span>
              <span style="color: #00eff0;">(</span>flycheck-mode<span style="color: #00eff0;">)</span><span style="color: #ff66ff;">)</span><span style="color: #ffffff;">)</span>

  <span style="color: #989898;">;; </span><span style="color: #989898;">helper package (I should turn this into maybe)
</span>  <span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">require</span> <span style="color: #b6a0ff;">'</span><span style="color: #00bcff;">flycheck-popup-tip</span><span style="color: #ffffff;">)</span>
  <span style="color: #ffffff;">(</span>flycheck-popup-tip-mode<span style="color: #ffffff;">)</span>

</pre>
</div>

<p>
Evaluate the new flycheck definition above, open an erlang buffer in emacs and run:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">M-x flycheck-verify-setup
</pre>
</div>

<p>
Sample output:
</p>

<pre class="example" id="org4830c08">
Syntax checkers for buffer tui_loop.erl in erlang-mode:

First checker to run:

  erlang-rebar3
    - may enable: yes
    - may run:    t
    - executable: Found at /opt/homebrew/bin/rebar3

Checkers that could run if selected:

  erlang  select
    - may enable: yes
    - executable: Found at /opt/homebrew/bin/erlc


Flycheck Mode is enabled.  Use C-u M-x flycheck-disable-checker to
enable disabled checkers.

</pre>


<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">setq</span> erl-nodename-cache
      <span style="color: #ff66ff;">(</span>make-symbol
       <span style="color: #00eff0;">(</span>concat <span style="color: #79a8ff;">"emacs-node@"</span>
               <span style="color: #ff6b55;">(</span>car <span style="color: #efef00;">(</span>split-string <span style="color: #b6a0ff;">(</span>shell-command-to-string <span style="color: #79a8ff;">"hostname"</span><span style="color: #b6a0ff;">)</span><span style="color: #efef00;">)</span><span style="color: #ff6b55;">)</span><span style="color: #00eff0;">)</span><span style="color: #ff66ff;">)</span><span style="color: #ffffff;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org37509bf" class="outline-2">
<h2 id="org37509bf">Rebar3 Integration</h2>
<div class="outline-text-2" id="text-org37509bf">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">setq</span> inferior-erlang-machine <span style="color: #79a8ff;">"rebar3"</span><span style="color: #ffffff;">)</span>
<span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">setq</span> inferior-erlang-machine-options <span style="color: #b6a0ff;">'</span><span style="color: #ff66ff;">(</span><span style="color: #79a8ff;">"shell"</span><span style="color: #ff66ff;">)</span><span style="color: #ffffff;">)</span>
<span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">setq</span> inferior-erlang-shell-type nil<span style="color: #ffffff;">)</span>
</pre>
</div>

<p>
I've also found out that by default emacs will start any erlang shell
from the current directory that you have open, which is fine if you have
the root of the project open, but annoying if you have an erlang source file
open.
</p>

<p>
This attempts to set the directory correctly, to the first parent directory that
contains a rebar.config file.
</p>


<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">my-erlang-set-project-root</span> <span style="color: #ff66ff;">()</span>
  <span style="color: #9ac8e0;">"Set `default-directory` to the parent dir containing `rebar.config` or `rebar.config.script`, if found."</span>
  <span style="color: #ff66ff;">(</span><span style="color: #b6a0ff;">when</span> <span style="color: #00eff0;">(</span>derived-mode-p <span style="color: #b6a0ff;">'</span><span style="color: #00bcff;">erlang-mode</span><span style="color: #00eff0;">)</span>
    <span style="color: #00eff0;">(</span><span style="color: #b6a0ff;">let*</span> <span style="color: #ff6b55;">(</span><span style="color: #efef00;">(</span>start <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff;">or</span> <span style="color: #44df44;">(</span>buffer-file-name<span style="color: #44df44;">)</span> default-directory<span style="color: #b6a0ff;">)</span><span style="color: #efef00;">)</span>
           <span style="color: #efef00;">(</span>proj-root
            <span style="color: #b6a0ff;">(</span>locate-dominating-file
             start
             <span style="color: #44df44;">(</span><span style="color: #b6a0ff;">lambda</span> <span style="color: #79a8ff;">(</span>dir<span style="color: #79a8ff;">)</span>
               <span style="color: #79a8ff;">(</span><span style="color: #b6a0ff;">or</span> <span style="color: #f78fe7;">(</span>file-exists-p <span style="color: #ffffff;">(</span>expand-file-name <span style="color: #79a8ff;">"rebar.config"</span> dir<span style="color: #ffffff;">)</span><span style="color: #f78fe7;">)</span>
                   <span style="color: #f78fe7;">(</span>file-exists-p <span style="color: #ffffff;">(</span>expand-file-name <span style="color: #79a8ff;">"rebar.config.script"</span> dir<span style="color: #ffffff;">)</span><span style="color: #f78fe7;">)</span><span style="color: #79a8ff;">)</span><span style="color: #44df44;">)</span><span style="color: #b6a0ff;">)</span><span style="color: #efef00;">)</span><span style="color: #ff6b55;">)</span>
      <span style="color: #ff6b55;">(</span><span style="color: #b6a0ff;">when</span> proj-root
        <span style="color: #efef00;">(</span><span style="color: #b6a0ff;">setq-local</span> default-directory proj-root<span style="color: #efef00;">)</span><span style="color: #ff6b55;">)</span><span style="color: #00eff0;">)</span><span style="color: #ff66ff;">)</span><span style="color: #ffffff;">)</span>

<span style="color: #ffffff;">(</span>add-hook <span style="color: #b6a0ff;">'</span><span style="color: #00bcff;">erlang-mode-hook</span> <span style="color: #b6a0ff;">#'</span><span style="color: #00bcff;">my-erlang-set-project-root</span><span style="color: #ffffff;">)</span>
</pre>
</div>

<p>
Now when opening an erlang file in emacs, it shoud set the cwd.
</p>

<p>
You can check that by opening any erlang file and then in emacs, executing.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">M-x pwd
</pre>
</div>

<p>
It should be the parent directory which contains a rebar.config file.
</p>
</div>
</div>
<div id="outline-container-org691bb7d" class="outline-2">
<h2 id="org691bb7d">Erlang Language Platform (ELP) as the LSP (Language Server Protocol)</h2>
<div class="outline-text-2" id="text-org691bb7d">
<p>
Previously I had been using <a href="https://github.com/erlang-ls/erlang_ls">erlang_ls</a> as a language server.  As of Aug 16, 2025, this project has been archived on github, Thank you
Roberto Aloi for all the hard work that was part of this great tool.  I haven't been able to get elp working reliably with
lsp-mode in emacs, so eglot seems to be the current method of sanity.
</p>

<p>
The shiny new thing: WhatsApp’s <a href="https://github.com/WhatsApp/erlang-language-platform">Erlang Language Platform (ELP)</a>. Download \the release and set it up,  I put in
the home directory ~/bin because thats in the path. 
</p>

<div class="org-src-container">
<pre class="src src-bash">wget https://github.com/WhatsApp/erlang-language-platform/releases/download/2025-07-21/elp/&lt;path-arch-specific.tar.gz.
tat xvf arch-specific-elptar.gz
chmod +x elp
mv elp ~/bin/
</pre>
</div>

<p>
If your running something like OSX which doesnt inherit from the shell for new executions, take a look at the <code>exec-path-from-shell</code> package
(See <a href="https://github.com/purcell/exec-path-from-shell">https://github.com/purcell/exec-path-from-shell</a>), which will make syncing up environments .. much easier.
</p>


<p>
Configure Emacs:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">require</span> <span style="color: #b6a0ff;">'</span><span style="color: #00bcff;">eglot</span><span style="color: #ffffff;">)</span>
<span style="color: #ffffff;">(</span>add-to-list <span style="color: #b6a0ff;">'</span><span style="color: #00bcff;">eglot-server-programs</span> <span style="color: #b6a0ff;">'</span><span style="color: #ff66ff;">(</span>erlang-mode . <span style="color: #00eff0;">(</span><span style="color: #79a8ff;">"elp"</span> <span style="color: #79a8ff;">"server"</span><span style="color: #00eff0;">)</span><span style="color: #ff66ff;">)</span><span style="color: #ffffff;">)</span>
<span style="color: #ffffff;">(</span>add-hook <span style="color: #b6a0ff;">'</span><span style="color: #00bcff;">erlang-mode-hook</span> <span style="color: #b6a0ff;">'</span><span style="color: #00bcff;">eglot-ensure</span><span style="color: #ffffff;">)</span>
</pre>
</div>

<p>
When you open an erlang file now, the LSP should be connected and you should see a mention of a connection to the LSP in the <code>*Messages*</code>
buffer.
</p>
</div>
</div>
<div id="outline-container-org7cc42f8" class="outline-2">
<h2 id="org7cc42f8">Closing</h2>
<div class="outline-text-2" id="text-org7cc42f8">
<p>
That’s my erlang editing stack in 2025: Erlang mode, Erlang tree-sitter, Flycheck, rebar3 integration, and WhatsApp’s LSP server.
</p>

<p>
Once you glue the bits together you get a modern editing experience in Emacs without losing the battle-tested tools from the past.
</p>

<p>
If you hit weird errors:
</p>
<ul class="org-ul">
<li>check that your path is correct (maybe m-x exec-path-from-shell-initialize)</li>
<li>check your paths, make sure OTP is built with all the extras</li>
<li>confirm Distel was actually compiled.</li>
</ul>

<p>
If you have another editor setup for Erlang post 2024 contact me and , i'll link it here.
</p>
</div>
</div>
</div>
</body>
</html>
